---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue
source: html/7d01743e-47b6-0629-4685-bd0626871d78.htm
---
# ElectricalDemandFactorValue Members

Default constructor. Initializes factor to 1.0 or 100%. Min and max range are set to 0.0